# Importación de librerias

In [1]:
import pandas as pd
import numpy as np

In [139]:
import sys
sys.executable

'/Users/carlagallo/Desktop/Proyectos DA/.venv/bin/python'

In [2]:
import openpyxl
openpyxl.__version__
pd.__version__

ModuleNotFoundError: No module named 'openpyxl'

# Carga de datos #

# Campañas de marketing #

In [141]:
df_marketing = pd.read_csv('../Datos/raw/bank-additional.csv')

In [142]:
df_marketing.head()

,Unnamed: 0,age,job,marital,education,default,housing,loan,contact,duration,...,emp.var.rate,cons.price.idx,cons.conf.idx,euribor3m,nr.employed,y,date,latitude,longitude,id_
0,0,NaN,housemaid,MARRIED,basic.4y,0.0,0.0,0.0,telephone,261,...,1.1,"93,994","-36,4","4,857",5191,no,2-agosto-2019,41.495,-71.233,089b39d8-e4d0-461b-87d4-814d71e0e079
1,1,57.0,services,MARRIED,high.school,NaN,0.0,0.0,telephone,149,...,1.1,"93,994","-36,4",NaN,5191,no,14-septiembre-2016,34.601,-83.923,e9d37224-cb6f-4942-98d7-46672963d097
2,2,37.0,services,MARRIED,high.school,0.0,1.0,0.0,telephone,226,...,1.1,"93,994","-36,4","4,857",5191,no,15-febrero-2019,34.939,-94.847,3f9f49b5-e410-4948-bf6e-f9244f04918b
3,3,40.0,admin.,MARRIED,basic.6y,0.0,0.0,0.0,telephone,151,...,1.1,"93,994","-36,4",NaN,5191,no,29-noviembre-2015,49.041,-70.308,9991fafb-4447-451a-8be2-b0df6098d13e
4,4,56.0,services,MARRIED,high.school,0.0,0.0,1.0,telephone,307,...,1.1,"93,994","-36,4",NaN,5191,no,29-enero-2017,38.033,-104.463,eca60b76-70b6-4077-80ba-bc52e8ebb0eb

In [143]:
df_marketing.shape

(43000, 24)

In [144]:
df_marketing.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 43000 entries, 0 to 42999
Data columns (total 24 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Unnamed: 0      43000 non-null  int64
 1   age             37880 non-null  float64
 2   job             42655 non-null  object
 3   marital         42915 non-null  object
 4   education       41193 non-null  object
 5   default         34019 non-null  float64
 6   housing         41974 non-null  float64
 7   loan            41974 non-null  float64
 8   contact         43000 non-null  object
 9   duration        43000 non-null  int64
 10  campaign        43000 non-null  int64
 11  pdays           43000 non-null  int64
 12  previous        43000 non-null  int64
 13  poutcome        43000 non-null  object
 14  emp.var.rate    43000 non-null  float64
 15  cons.price.idx  42529 non-null  object
 16  cons.conf.idx   43000 non-null  object
 17  euribor3m       33744 non-null  object
 18  nr.employed     43000 non-null  object
 19  y               43000 non-null  object
 20  date            42752 non-null  object
 21  latitude        43000 non-null  float64
 22  longitude       43000 non-null  float64
 23  id_             43000 non-null  object
dtypes: float64(7), int64(5), object(12)
memory usage: 7.9+ MB

In [145]:
df_marketing.describe()

,Unnamed: 0,age,default,housing,loan,duration,campaign,pdays,previous,emp.var.rate,latitude,longitude
count,43000.000000,37880.000000,34019.000000,41974.000000,41974.000000,43000.000000,43000.000000,43000.000000,43000.000000,43000.000000,43000.000000,43000.000000
mean,20651.099047,39.977112,0.000088,0.535998,0.155620,257.739279,2.567233,962.330953,0.174023,0.077128,36.856697,-95.939067
std,11868.770913,10.437957,0.009390,0.498708,0.362499,258.666033,2.772294,187.260394,0.497366,1.573898,7.225948,16.752282
min,0.000000,17.000000,0.000000,0.000000,0.000000,0.000000,1.000000,0.000000,0.000000,-3.400000,24.396000,-124.997000
25%,10381.750000,32.000000,0.000000,0.000000,0.000000,102.000000,1.000000,999.000000,0.000000,-1.800000,30.614750,-110.494250
50%,20642.500000,38.000000,0.000000,1.000000,0.000000,179.000000,2.000000,999.000000,0.000000,1.100000,36.761000,-95.899500
75%,30930.250000,47.000000,0.000000,1.000000,0.000000,319.000000,3.000000,999.000000,0.000000,1.400000,43.113250,-81.427750
max,41187.000000,98.000000,1.000000,1.000000,1.000000,4918.000000,56.000000,999.000000,7.000000,1.400000,49.384000,-66.937000

In [146]:
df_marketing.columns

Index(['Unnamed: 0', 'age', 'job', 'marital', 'education', 'default',
       'housing', 'loan', 'contact', 'duration', 'campaign', 'pdays',
       'previous', 'poutcome', 'emp.var.rate', 'cons.price.idx',
       'cons.conf.idx', 'euribor3m', 'nr.employed', 'y', 'date', 'latitude',
       'longitude', 'id_'],
      dtype='object')

# Columnas del dataset  #

df_marketing:

age: La edad del cliente.

job: La ocupación o profesión del cliente.

marital: El estado civil del cliente.

education: El nivel educativo del cliente.

default: Indica si el cliente tiene algún historial de incumplimiento de pagos (1: Sí, 0: No).

housing: Indica si el cliente tiene un préstamo hipotecario (1: Sí, 0: No).

loan: Indica si el cliente tiene algún otro tipo de préstamo (1: Sí, 0: No).

contact: El método de contacto utilizado para comunicarse con el cliente.

duration: La duración en segundos de la última interacción con el cliente.

campaign: El número de contactos realizados durante esta campaña para este cliente.

pdays: Número de días que han pasado desde la última vez que se contactó con el cliente durante esta campaña.

previous: Número de veces que se ha contactado con el cliente antes de esta campaña.

poutcome: Resultado de la campaña de marketing anterior.

emp.var.rate: La tasa de variación del empleo.

cons.price.idx: El índice de precios al consumidor.

cons.conf.idx: El índice de confianza del consumidor.

euribor3m: La tasa de interés de referencia a tres meses.

nr.employed: El número de empleados.

y: Indica si el cliente ha suscrito un producto o servicio (Sí/No).

date: La fecha en la que se realizó la interacción con el cliente.

contact_month: Mes en el que se realizó la interacción con el cliente durante la campaña de marketing.

contact_year: Año en el que se realizó la interacción con el cliente durante la campaña de marketing.

id_: Un identificador único para cada registro en el dataset.

# Características del cliente #

In [147]:
df_customers = pd.read_excel('../Datos/raw/customer-details.xlsx')

In [148]:
xls = pd.read_excel(
    '../Datos/raw/customer-details.xlsx',
    sheet_name=None
)

In [149]:
""" VISTA DE LAS HOJAS DEL ARCHIVO EXCEL """

xls.keys()

dict_keys(['2012', '2013', '2014'])

In [150]:
""" CONCATENAR LAS HOJAS DEL ARCHIVO EXCEL EN UN SOLO DATAFRAME """

df_customers = pd.concat(
    xls.values(),
    ignore_index=True
)

In [151]:
df_customers.head()

,Unnamed: 0,Income,Kidhome,Teenhome,Dt_Customer,NumWebVisitsMonth,ID
0,0,161770,1,0,2012-04-04,29,089b39d8-e4d0-461b-87d4-814d71e0e079
1,1,85477,1,1,2012-12-30,7,e9d37224-cb6f-4942-98d7-46672963d097
2,2,147233,1,1,2012-02-02,5,3f9f49b5-e410-4948-bf6e-f9244f04918b
3,3,121393,1,2,2012-12-21,29,9991fafb-4447-451a-8be2-b0df6098d13e
4,4,63164,1,2,2012-06-20,20,eca60b76-70b6-4077-80ba-bc52e8ebb0eb

In [152]:
df_customers.shape

(43170, 7)

In [153]:
df_customers.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 43170 entries, 0 to 43169
Data columns (total 7 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Unnamed: 0         43170 non-null  int64
 1   Income             43170 non-null  int64
 2   Kidhome            43170 non-null  int64
 3   Teenhome           43170 non-null  int64
 4   Dt_Customer        43170 non-null  datetime64[ns]
 5   NumWebVisitsMonth  43170 non-null  int64
 6   ID                 43170 non-null  object
dtypes: datetime64[ns](1), int64(5), object(1)
memory usage: 2.3+ MB

In [154]:
df_customers.columns

Index(['Unnamed: 0', 'Income', 'Kidhome', 'Teenhome', 'Dt_Customer',
       'NumWebVisitsMonth', 'ID'],
      dtype='object')

Dataset 2 

Income: Representa el ingreso anual del cliente en términos monetarios.

Kidhome: Indica el número de niños en el hogar del cliente.

Teenhome: Indica el número de adolescentes en el hogar del cliente.

Dt_Customer: Representa la fecha en que el cliente se convirtió en cliente de la empresa.

NumWebVisitsMonth: Indica la cantidad de visitas mensuales del cliente al sitio web de la empresa.

ID: Identificador único del cliente.

## Análisis preeliminar ##

VALORES NULOS

In [155]:
df_marketing.isnull().sum()

Unnamed: 0           0
age               5120
job                345
marital             85
education         1807
default           8981
housing           1026
loan              1026
contact              0
duration             0
campaign             0
pdays                0
previous             0
poutcome             0
emp.var.rate         0
cons.price.idx     471
cons.conf.idx        0
euribor3m         9256
nr.employed          0
y                    0
date               248
latitude             0
longitude            0
id_                  0
dtype: int64

In [156]:
"""Manejo de valores nulos en variables categóricas
"""

df_marketing['job'] = df_marketing['job'].fillna('unknown')
df_marketing['marital'] = df_marketing['marital'].fillna('unknown')
df_marketing['education'] = df_marketing['education'].fillna('unknown')
df_marketing['default'] = df_marketing['default'].fillna('unknown')
df_marketing['housing'] = df_marketing['housing'].fillna('unknown')
df_marketing['loan'] = df_marketing['loan'].fillna('unknown')

In [157]:
"""Se completa el valor nulo de la variable 'euribor3m' con el dato faltante que es el mismo en todos los casos"""

df_marketing['euribor3m']= df_marketing ['euribor3m'].fillna(4.857)

In [158]:
"""Se completa el valor nulo de la variable 'age' con la mediana de la misma"""

df_marketing['age'] = df_marketing['age'].fillna(df_marketing['age'].median())

In [159]:
""" Se cambia el formato de la variable 'cons.price.idx' para convertirla a numérica """

df_marketing['cons.price.idx'] = df_marketing['cons.price.idx'].astype(str).str.replace(',', '.').str.strip()

df_marketing['cons.price.idx'] = pd.to_numeric(df_marketing['cons.price.idx'], errors='coerce')

In [160]:
"""Se completa el valor nulo de la variable 'cons.price.idx' con la mediana de la misma"""

df_marketing['cons.price.idx'] = df_marketing['cons.price.idx'].fillna(df_marketing['cons.price.idx'].median())

In [161]:
df_marketing.isnull().sum()

Unnamed: 0          0
age                 0
job                 0
marital             0
education           0
default             0
housing             0
loan                0
contact             0
duration            0
campaign            0
pdays               0
previous            0
poutcome            0
emp.var.rate        0
cons.price.idx      0
cons.conf.idx       0
euribor3m           0
nr.employed         0
y                   0
date              248
latitude            0
longitude           0
id_                 0
dtype: int64

Duplicados

In [162]:
df_marketing.duplicated().sum()

np.int64(0)

Fechas: se debe establecer el tipo de dato como datetime y completar los nulos con la moda ya que es un dato relevante para el modelo.

Normalizar datos

Conversion de tipo de datos

Nulos

In [164]:
df_customers.isnull().sum()

Unnamed: 0           0
Income               0
Kidhome              0
Teenhome             0
Dt_Customer          0
NumWebVisitsMonth    0
ID                   0
dtype: int64

In [165]:
df_customers.duplicated().sum()

np.int64(0)